src/cf/InformationRegisters/ДатыВводаНачальныхОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ДатыВводаНачальныхОстатков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаВводаНачальныхОстатков</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ДатыВводаНачальныхОстатков/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает дату ввода начальных остатков
//
// Параметры:
// Организация - СправочникСсылка.Организация
//
// Возвращаемое значение:
// Дата или Неопределено, если дата не задана
//
Функция ДатаВводаНачальныхОстатков(Организация) Экспорт
	
	ДоступныеОрганизации = ОбщегоНазначенияБПВызовСервераПовтИсп.ВсеОрганизацииДанныеКоторыхДоступныПоRLS(ложь);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДоступныеОрганизации", ДоступныеОрганизации);
	
	Если ЗначениеЗаполнено(Организация) Тогда 
		
		Если ДоступныеОрганизации.Найти(Организация) = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДатыВводаНачальныхОстатков.ДатаВводаНачальныхОстатков
		|ИЗ
		|	РегистрСведений.ДатыВводаНачальныхОстатков КАК ДатыВводаНачальныхОстатков
		|ГДЕ
		|	ДатыВводаНачальныхОстатков.Организация = &Организация";
		
	Иначе
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(МИНИМУМ(ДатыВводаНачальныхОстатков.ДатаВводаНачальныхОстатков), НЕОПРЕДЕЛЕНО) КАК ДатаВводаНачальныхОстатков
		|ИЗ
		|	РегистрСведений.ДатыВводаНачальныхОстатков КАК ДатыВводаНачальныхОстатков
		|ГДЕ
		|	ДатыВводаНачальныхОстатков.Организация В(&ДоступныеОрганизации)";
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДатаВводаНачальныхОстатков;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
